using System; // Підключення простору імен System для використання класів та методів, таких як Console, Convert, тощо

namespace lab._3 // Визначення простору імен для організації коду
{
    internal class Program // Визначення внутрішнього класу Program, який містить метод Main - точку входу в програму
    {
        void input(ref double[] arr, string s) // Метод для введення елементів масиву з консолі
        {
            string str; // Локальна змінна для зберігання введеного рядка перед конвертацією в число

            Console.WriteLine("Введіть елементи масиву {0}:", s);
            Console.WriteLine();
            for (int i = 0; i < arr.Length; i++) // Оператор циклу for, цикл для введення кожного елемента масиву
            {
                Console.Write("{0}[{1}] = ", s, i);
                str = Console.ReadLine(); // Зчитування рядка з консолі
                arr[i] = Convert.ToDouble(str); // Конвертація введеного рядка в тип double і збереження його в масиві
            }
            Console.WriteLine();
        }
        void process(ref double[] arr, out double sum, out double avg, out double xi, out double xn) // Метод для обчислення суми та середнього значення елементів масиву в заданому інтервалі [xi, xn]
        {
            string s; // Оголошення локальної змінної для зберігання введеного рядка перед конвертацією в число
            sum = avg = 0; // Ініціалізація змінних sum та avg нулями
            int count = 0; // Оголошення локальної змінної для підрахунку кількості елементів масиву, які потрапляють в інтервал [xi, xn]

            Console.WriteLine("Введіть межі інтервалу для обчислення суми і середнього значення: ");
            Console.WriteLine();

            while (true) // Нескінченний цикл для введення коректних меж інтервалу
            {
                Console.Write("Нижня межа інтервалу: ");
                s = Console.ReadLine(); // Зчитування рядка з консолі для нижньої межі інтервалу
                xi = Convert.ToDouble(s); // Конвертація введеного рядка в тип double і збереження його в змінній xi

                Console.Write("Верхня межа інтервалу: ");
                s = Console.ReadLine(); // Зчитування рядка з консолі для верхньої межі інтервалу
                xn = Convert.ToDouble(s); // Конвертація введеного рядка в тип double і збереження його в змінній xn

                if (xi == xn) // Умовний оператор if, перевірка на рівність нижньої та верхньої межі інтервалу
                {
                    Console.WriteLine();
                    Console.WriteLine("[УВАГА] - Нижня і верхня межа інтервалу не можуть бути однаковими!\nСпробуйте ввести ще раз!");
                    continue; // Якщо межі інтервалу однакові, виводиться повідомлення і цикл повторюється для повторного введення
                }
                if (xi > xn) // Умовний оператор if, перевірка на те, що нижня межа інтервалу не повинна бути більшою за верхню
                {
                    Console.WriteLine();
                    Console.WriteLine("[УВАГА] - Нижня межа інтервалу повинна бути меншою за верхню!\nСпробуйте ввести ще раз!");
                    continue; // Якщо нижня межа інтервалу більша за верхню, виводиться повідомлення і цикл повторюється для повторного введення
                }
                else // Якщо введені межі інтервалу коректні, цикл завершується
                {
                    break;
                }
            }
            for (int i = 0; i < arr.Length; i++) // Оператор циклу for, цикл для обчислення суми та середнього значення елементів масиву, які потрапляють в інтервал [xi, xn]
            {
                if (arr[i] >= xi && arr[i] <= xn) // Умовний оператор if, перевірка на те, чи потрапляє елемент масиву в інтервал [xi, xn]
                {
                    sum += arr[i]; // Якщо елемент масиву потрапляє в інтервал, він додається до суми sum
                    count++; // Лічильник count збільшується на 1 для підрахунку кількості елементів, які потрапляють в інтервал
                }
            }
            if (count > 0) // Умовний оператор if, перевірка на те, що в інтервалі [xi, xn] є хоча б один елемент масиву
            {
                avg = sum / count; // Якщо в інтервалі є елементи, обчислюється середнє значення шляхом ділення суми sum на кількість count
            }
            else // Якщо в інтервалі немає елементів, середнє значення встановлюється в 0
            { 
                avg = 0; 
            }
        }
        static void Main(string[] args) // Метод Main - точка входу в програму
        {
            Console.OutputEncoding = System.Text.Encoding.UTF8; // Встановлення кодування виводу консолі на UTF-8 для підтримки українських символів

            Program ob = new Program(); // Створення об'єкта класу Program для виклику методів input та process

            double sum, avg; // Оголошення локальних змінних для зберігання суми та середнього значення елементів масиву, які потрапляють в інтервал [xi, xn]
            string[] symbols = new string[3]; // Оголошення масиву символів для зберігання імен масивів, які будуть введені користувачем
            int n; // Оголошення локальної змінної для зберігання розміру масиву, який буде введений користувачем
            double xi = 0; // Ініціалізація змінної xi нулем для зберігання нижньої межі інтервалу
            double xn = 0; // Ініціалізація змінної xn нулем для зберігання верхньої межі інтервалу
            string s; // Оголошення локальної змінної для зберігання введеного рядка перед конвертацією в число або символ

            for (int i = 0; i < 3; i++) // Оператор циклу for, цикл для введення імен масивів, які будуть введені користувачем
            {
                Console.Write("Введіть ім'я масиву {0}: ", i+1);
                symbols[i] = Console.ReadLine(); // Зчитування рядка з консолі для імені масиву     
            }

            Console.WriteLine();

            Console.Write("Введіть розмір масиву {0}: ", symbols[0]);
            s = Console.ReadLine(); // Зчитування рядка з консолі для розміру масиву
            n = Convert.ToInt32(s); // Конвертація введеного рядка в тип int і збереження його в змінній n для розміру масиву
            Console.WriteLine();
            if (n < 1) // Умовний оператор if, перевірка на те, що розмір масиву повинен бути більшим за 1
            {
                Console.WriteLine("[ПОМИЛКА] - Розмір масиву повинен бути більшим за 1!");
                return; // Якщо розмір масиву менший за 1, виводиться повідомлення про помилку і програма завершується
            }
            double[] array1 = new double[n]; // Оголошення масиву типу double з розміром n для зберігання елементів першого масиву
            ob.input(ref array1, symbols[0]); // Виклик методу input для введення елементів першого масиву з консолі, передаючи його за посиланням та ім'я масиву
            ob.process(ref array1, out sum, out avg, out xi, out xn); // Виклик методу process для обчислення суми та середнього значення елементів першого масиву, які потрапляють в інтервал [xi, xn], передаючи масив за посиланням та отримуючи результати через параметри out
            Console.WriteLine();
            Console.WriteLine("Сума елементів масиву {0} в інтервалі [{1}, {2}] дорівнює {3}\nСереднє арифметичне в інтервалі [{1}, {2}] дорівнює {4}", symbols[0], xi, xn, sum, avg);

            Console.WriteLine();
            Console.Write("Введіть розмір масиву {0}: ", symbols[1]);
            s = Console.ReadLine(); // Зчитування рядка з консолі для розміру другого масиву
            n = Convert.ToInt32(s); // Конвертація введеного рядка в тип int і збереження його в змінній n для розміру другого масиву
            Console.WriteLine();
            if (n < 1) // Умовний оператор if, перевірка на те, що розмір масиву повинен бути більшим за 1
            {
                Console.WriteLine("[ПОМИЛКА] - Розмір масиву повинен бути більшим за 1!");
                return; // Якщо розмір масиву менший за 1, виводиться повідомлення про помилку і програма завершується
            }
            double[] array2 = new double[n]; // Оголошення масиву типу double з розміром n для зберігання елементів другого масиву
            ob.input(ref array2, symbols[1]); // Виклик методу input для введення елементів другого масиву з консолі, передаючи його за посиланням та ім'я масиву
            ob.process(ref array2, out sum, out avg, out xi, out xn); // Виклик методу process для обчислення суми та середнього значення елементів другого масиву, які потрапляють в інтервал [xi, xn], передаючи масив за посиланням та отримуючи результати через параметри out
            Console.WriteLine();
            Console.WriteLine("Сума елементів масиву {0} в інтервалі [{1}, {2}] дорівнює {3}\nСереднє арифметичне в інтервалі [{1}, {2}] дорівнює {4}", symbols[1], xi, xn, sum, avg);

            Console.WriteLine();
            Console.Write("Введіть розмір масиву {0}: ", symbols[2]);
            s = Console.ReadLine(); // Зчитування рядка з консолі для розміру третього масиву
            n = Convert.ToInt32(s); // Конвертація введеного рядка в тип int і збереження його в змінній n для розміру третього масиву
            Console.WriteLine();
            if (n < 1) // Умовний оператор if, перевірка на те, що розмір масиву повинен бути більшим за 1
            {
                Console.WriteLine("[ПОМИЛКА] - Розмір масиву повинен бути більшим за 1!");
                return; // Якщо розмір масиву менший за 1, виводиться повідомлення про помилку і програма завершується
            }
            double[] array3 = new double[n]; // Оголошення масиву типу double з розміром n для зберігання елементів третього масиву
            ob.input(ref array3, symbols[2]); // Виклик методу input для введення елементів третього масиву з консолі, передаючи його за посиланням та ім'я масиву
            ob.process(ref array3, out sum, out avg, out xi, out xn); // Виклик методу process для обчислення суми та середнього значення елементів третього масиву, які потрапляють в інтервал [xi, xn], передаючи масив за посиланням та отримуючи результати через параметри out
            Console.WriteLine();
            Console.WriteLine("Сума елементів масиву {0} в інтервалі [{1}, {2}] дорівнює {3}\nСереднє арифметичне в інтервалі [{1}, {2}] дорівнює {4}", symbols[2], xi, xn, sum, avg);
        }
    }
}
