using System; // Підключення директиви

namespace lab._4._3
{
    internal class Program
    {
        void output(int []array1, int[] array2) // Метод для виведення площ полів та їх номерів на консоль
        {
            for (int i = 0; i < array1.Length; i++) // Оператор циклу for, виведення площ полів та їх номерів на консоль
            { 
                Console.WriteLine(" --------------------------");
                Console.WriteLine("| Поле №{0,4} | {1,8}м^2 |", array2[i], array1[i]); 
            }
            Console.WriteLine(" --------------------------");
        }
        static void Main(string[] args) // Головний метод програми
        {
            Console.OutputEncoding = System.Text.Encoding.UTF8; // Встановлення кодування виводу на UTF-8 для підтримки українських символів
            int n;
            string s;
            Program program = new Program(); // Створення посилання на об'єкт класу Program для виклику методу output
            Random rnd = new Random(); // Створення посилання на об'єкт класу Random для генерації випадкових чисел
            Console.Write("Введіть кількість польових ділянок, що потребують обробки: ");

            s = Console.ReadLine(); // Зчитування кількості полів з консолі
            n = Convert.ToInt32(s); // Конвертація введеного рядка в ціле число

            while (true) // Оператор циклу while, перевірка на правильність введеної кількості полів
            {
                if (n <= 1) // Умовний оператор if, якщо кількість полів менше або дорівнює 1
                {
                    Console.Write("Кількість польових ділянок повинна бути більше 1. Введіть ще раз: ");
                    s = Console.ReadLine(); // Зчитування кількості полів з консолі
                    n = Convert.ToInt32(s); // Конвертація введеного рядка в ціле число
                }
                else // Умовний оператор else, якщо кількість полів більше 1
                {
                    break; // Вихід з циклу, якщо кількість полів більше 1
                }
            }
            // Ініціалізація масивів для зберігання площ полів та їх номерів
            int[] fields = new int[n];
            int[] number = new int[n];

            for (int i = 0; i < fields.Length; i++) // Оператор циклу for, заповнення масивів площ полів та їх номерів
            {
                fields[i] = rnd.Next(100, 1500); // Генерація випадкової площі поля в діапазоні від 100 до 1500
                number[i] = i + 1; // Заповнення масиву номерів полів, починаючи з 1
            }

            Console.WriteLine("\nПлоща польових ділянок:");
            program.output(fields, number);

            Array.Sort(fields, number); // Сортування масивів площ полів та їх номерів за допомогою методу Array.Sort
            Array.Reverse(fields); // Зворотній порядок масиву площ полів для отримання спадного порядку
            Array.Reverse(number); // Зворотній порядок масиву номерів полів для відповідності з відсортованим масивом площ полів

            Console.WriteLine("\nПлоща польових ділянок у порядку спадання:");
            program.output(fields, number);
        }
    }
}
